src/InformationRegisters/СхемаАдресацииЗадач/СхемаАдресацииЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СхемаАдресацииЗадач</name>
  <resources>
    <name>РольПользователя</name>
    <type>
      <types>CatalogRef.РолиПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипИсполнителя</name>
    <type>
      <types>CatalogRef.ТипыИсполнителейКонтрольПамяти</types>
      <types>CatalogRef.ТипыИсполнителей</types>
      <types>CatalogRef.ТипыИсполнителейВнешнийКонтрольЦКК</types>
      <types>CatalogRef.ТипыИсполнителейАнализВызововКластера1С</types>
      <types>CatalogRef.ТипыИсполнителейОценкаПользователей</types>
      <types>CatalogRef.ТипыИсполнителейКонтрольПодключений</types>
      <types>CatalogRef.ТипыИсполнителейСборДампов</types>
      <types>CatalogRef.ТипыИсполнителейКонтрольПроизводительности</types>
      <types>CatalogRef.ТипыИсполнителейКонтрольРегламентныхЗаданий</types>
      <types>CatalogRef.ТипыИсполнителейКонтрольЧислаИсключений</types>
      <types>CatalogRef.ТипыИсполнителейКонтрольНагрузочныхТестов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КонтрольнаяПроцедура</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.ВидыКонтрольныхПроцедур</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СвязьПользовательРоль/СвязьПользовательРоль.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязьПользовательРоль</name>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ОценкаПользователейСервер/Module.bsl
Процедура ВыполнитьАнализ(КонтрольнаяПроцедура) Экспорт
	НетПроблем = Истина;
	
	// Найти всех пользователей роли и сгенерировать им задачу
	
	// Вначале получаем роль, на которую возложена обязанность,
	// заполнять формы с оценкой пользователей
	Роль = РегистрыСведений.СхемаАдресацииЗадач.Получить(Новый Структура(
		"ТипИсполнителя, КонтрольнаяПроцедура",
		Справочники.ТипыИсполнителейОценкаПользователей.ОтветственныйЗаЗаполнениеФормыОценкиРаботыСистемы,
		КонтрольнаяПроцедура
	))["РольПользователя"];
	
	// Далее перебираем пользователей роли и вешаем на них задачу
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СвязьПользовательРоль.Пользователь
	|ИЗ
	|	РегистрСведений.СвязьПользовательРоль КАК СвязьПользовательРоль
	|ГДЕ
	|	СвязьПользовательРоль.Роль = &Роль";
	Запрос.УстановитьПараметр("Роль", Роль);
	
	ВыборкаПользователей = Запрос.Выполнить().Выбрать();
	
	ИмяСтраницыСправки = "ОценкаПользователейДатьОценку";
	Сообщение = НСтр("ru = 'Дайте свою оценку работе системы.'");
	
	Пока ВыборкаПользователей.Следующий() Цикл
		Пользователь = ВыборкаПользователей.Пользователь;
	КонецЦикла;
	
КонецПроцедуры
